_Rarzrabotki/Rarus/USO2/Documents/УСОERP_УтверждениеКалендарногоПланаГрафика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_УтверждениеКалендарногоПланаГрафика</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВерсииПлана</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_СтатусыУтвержденияКалендарногоПланаГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СценарийПланирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СценарииПланированияПроектовСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПланов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Актуальный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КопияСценария</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СценарииПланированияПроектовСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемРаботы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаОбъема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоРаботыПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкончаниеРаботыПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаДлительности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммарнаяРабота</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Родитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_УтверждениеКалендарногоПланаГрафика/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗначениеКопирования") Тогда
		
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
	КонецЕсли;  	
	
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	ЗначенияДляЗаполнения = Новый Структура;
	ЗначенияДляЗаполнения.Вставить("Ответственный", "Объект.Ответственный");
	ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтаФорма, ЗначенияДляЗаполнения);
	
	ТекущийОбъектСтроительства = Объект.ОбъектСтроительства;
	ТекущаяОрганизация = Объект.Организация;
	ТекущийСценарий    = Объект.СценарийПланирования;   	
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(РаботыДС,"КопияСценария",Объект.КопияСценария,Истина);
	ЭлементОтбора = РаботыДС.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Объект.КопияСценария;
	
	СформироватьДеревоРабот();
	
	УстановитьУсловноеОформление();
	
	// Обработчик подсистемы "Свойства"
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Объект", Объект);
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, ДополнительныеПараметры);
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
	СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	НовыйВариант  = ЭтоНовыйВариантСценария(Объект.СценарийПланирования);
	
	УправлениеЭлементамиФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	

	РазвернутьДеревоРабот();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если ТекущаяОрганизация = Объект.Организация Тогда
		
		Объект.СценарийПланирования = ТекущийСценарий;
		ТекущаяОрганизация = Объект.Организация;
		
	Иначе
		
		РабочийСценарий = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьРабочийСценарий(Объект.ОбъектСтроительства, Объект.Организация);
		
		Объект.Актуальный = Ложь;
		
		Если ЗначениеЗаполнено(Объект.СценарийПланирования) И 
			РабочийСценарий <> Объект.СценарийПланирования И 			
			Объект.Работы.Количество()>0 Тогда
			
			ПоказатьВопрос(Новый ОписаниеОповещения("ОрганизацияПриИзмененииПродолжение",ЭтотОбъект),"Таблица работ будет перезаполнена. Продолжить?", РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Нет);
			
		Иначе
			
			ОрганизацияПриИзмененииПродолжение(КодВозвратаДиалога.Да,Новый Структура);
			
		КонецЕсли;
		
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеЭлементамиФормы(Форма)
	
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	
	ЭтоНовый = НЕ ЗначениеЗаполнено(Форма.Объект.Ссылка);
	НовыйВариант = Форма.НовыйВариант;
	СтарыйВариант = ЗначениеЗаполнено(Форма.Объект.ОбъектСтроительства) И НовыйВариант = Ложь;
	
	ИменаЭлементов = Новый Массив;
	
	ИменаЭлементов.Добавить("Дата");
	ИменаЭлементов.Добавить("ДатаВерсииПлана");
	ИменаЭлементов.Добавить("Статус");
	ИменаЭлементов.Добавить("Организация");
	ИменаЭлементов.Добавить("Проект");
	ИменаЭлементов.Добавить("СценарийПланирования");	
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ИменаЭлементов, "ТолькоПросмотр", НовыйВариант И Объект.Работы.Количество() И НЕ ЭтоНовый);
	
	ИменаЭлементов = Новый Массив;
	ИменаЭлементов.Добавить("ДеревоРаботОбновитьДеревоРабот");
	ИменаЭлементов.Добавить("Актуальный");	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ИменаЭлементов, "Видимость", НЕ НовыйВариант);
	
	Элементы.РаботыДССоздатьКопиюСценария.Видимость = НЕ ЗначениеЗаполнено(Объект.КопияСценария);
	
	Элементы.РаботыДСКомандаЗаполнитьРаспределениеРабот.Видимость = ВидимостьКнопкиЗаполнитьРаспределение(Объект.КопияСценария);
	Элементы.ДеревоРаботКомандаЗаполнитьРаспределениеРабот.Видимость = Элементы.РаботыДСКомандаЗаполнитьРаспределениеРабот.Видимость;
	Элементы.ДатаВерсииПлана.Видимость = СтарыйВариант;
	 
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзмененииПродолжение(Ответ,ДопПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		
		Объект.СценарийПланирования = ТекущийСценарий;
		Возврат;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ОбъектСтроительства) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	РабочийСценарий = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьРабочийСценарий(Объект.ОбъектСтроительства, Объект.Организация);
	
	Объект.СценарийПланирования = РабочийСценарий;
	НовыйВариант = ЭтоНовыйВариантСценария(Объект.СценарийПланирования);
	ЗаполнитьТаблицуРабот();
	СформироватьДеревоРабот();
	РазвернутьДеревоРабот();
	
	ТекущийОбъектСтроительства = Объект.ОбъектСтроительства;
	ТекущийСценарий = Объект.СценарийПланирования;
	
	ТекущаяОрганизация = Объект.Организация; 
	
	УправлениеЭлементамиФормы(ЭтаФорма);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ТекущийОбъектСтроительства)
		И ТекущийОбъектСтроительства <> Объект.ОбъектСтроительства Тогда		
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПроектПриИзмененииПродолжение",ЭтотОбъект),"Таблица работ будет перезаполнена. Продолжить?", РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Нет);
		
	Иначе
		
		ПроектПриИзмененииПродолжение(КодВозвратаДиалога.Да,Новый Структура);
		
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзмененииПродолжение(Ответ,ДопПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		
		Объект.ОбъектСтроительства = ТекущийОбъектСтроительства;
		Объект.СценарийПланирования = ТекущийСценарий;
		Возврат;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		
		ОбъектСтроительстваПриИзмененииНаСервере();	

		Возврат;
		
	КонецЕсли;  	
	
	Если ТекущийОбъектСтроительства <> Объект.ОбъектСтроительства Тогда
		
		Объект.СценарийПланирования = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьРабочийСценарий(Объект.ОбъектСтроительства, Объект.Организация);
		
		Объект.Актуальный = Ложь;
		НовыйВариант  = ЭтоНовыйВариантСценария(Объект.СценарийПланирования);
		
	Иначе
		
		Объект.СценарийПланирования = ТекущийСценарий;
		
	КонецЕсли;
	
	ОбъектСтроительстваПриИзмененииНаСервере();	
	
	ЗаполнитьТаблицуРабот();
	СформироватьДеревоРабот();
	РазвернутьДеревоРабот();
	
	ТекущийОбъектСтроительства = Объект.ОбъектСтроительства;
	ТекущийСценарий = Объект.СценарийПланирования;
	
	УправлениеЭлементамиФормы(ЭтаФорма); 
	
КонецПроцедуры 

&НаСервере
Процедура  	ОбъектСтроительстваПриИзмененииНаСервере()
	Объект.НаправлениеДеятельности = Объект.ОбъектСтроительства.ОбъектСтроительства.НаправлениеДеятельности;
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ЭтоНовыйВариантСценария(СценарийПланирования) Экспорт
	
	Возврат СценарийПланирования.НовыйВариант;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьДеревоРабот(Команда)
	
	Если ЗначениеЗаполнено(Объект.КопияСценария) Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбновитьДеревоРаботЗавершение",ЭтотОбъект);
		
		ТекстВопроса = ПолучитьТекстВопросаПоСценарию();
		
		ПоказатьВопрос(ОписаниеОповещения,ТекстВопроса,РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
		
	Иначе
		
		ОбновитьДеревоРаботЗавершение(КодВозвратаДиалога.Да, Новый Структура);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстВопросаПоСценарию()
	
	ТекстВопроса = "На данный момент существует копия сценария № "+Объект.КопияСценария.НомерВерсии+" от "+Формат(Объект.КопияСценария.ДатаСохранения,"ДФ=dd.MM.yyyy")+". Будет создана новая копия. Продолжить?";
	
	Возврат ТекстВопроса;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьДеревоРаботЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		ЗаполнитьТаблицуРабот();
		СформироватьДеревоРабот();
		РазвернутьДеревоРабот();
		ЭтаФорма.Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДеревоРабот()
	
	Если Объект.СценарийПланирования.НовыйВариант = Истина Тогда
		
		Элементы.ГруппаРаботы.Видимость = Объект.Работы.Количество();
		Элементы.ГруппаРаботыДС.Видимость = НЕ Объект.Работы.Количество();		
		Элементы.РаботыДССоздатьКопиюСценария.Видимость = НЕ ЗначениеЗаполнено(Объект.КопияСценария);
		Элементы.ДеревоРаботОбновитьДеревоРабот.Видимость = Ложь;		
		Элементы.РаботыДСКомандаЗаполнитьРаспределениеРабот.Видимость = ВидимостьКнопкиЗаполнитьРаспределение(Объект.КопияСценария);
		Элементы.ДеревоРаботКомандаЗаполнитьРаспределениеРабот.Видимость = Элементы.РаботыДСКомандаЗаполнитьРаспределениеРабот.Видимость;
		
		Если НЕ Объект.Работы.Количество() Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ГруппаРаботы.Видимость = Истина;
	
	Элементы.ГруппаРаботыДС.Видимость = Ложь;	
	
	ДанныеДляДерева = Объект.Работы.Выгрузить();
	РаботыВерхнегоУровня = ДанныеДляДерева.НайтиСтроки(Новый Структура("Родитель", Справочники.УСОERP_СтроительныеРаботы.ПустаяСсылка()));
	
	ВремРодноеДерево = РеквизитФормыВЗначение("ДеревоРабот"); // берется родная структура с родной типизацией
	ВремРодноеДерево.Строки.Очистить();
	
	Если Объект.СценарийПланирования.НовыйВариант Тогда
		
		Для Каждого РаботаВерхнегоУровня Из РаботыВерхнегоУровня Цикл
			НоваяСтрокаДерева = ВремРодноеДерево.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаДерева, РаботаВерхнегоУровня);
			ЗаполнитьДеревоРаботРекурсивно(ДанныеДляДерева, НоваяСтрокаДерева);
		КонецЦикла;
		
	Иначе
		
		Справочник = Справочники.УСОERP_СтроительныеРаботы;
		ДеревоРезультат = УСОERP_ОбработкаТабличныхЧастей.УСОERP_ПодготовитьДанныеИСформироватьДеревоСВосстановлениемСтруктуры(ДанныеДляДерева,"Работа","РаботаРодитель",,Справочники.УСОERP_СтроительныеРаботы);		
		УСОERP_ОбработкаТабличныхЧастей.УСОERP_ЗаполнитьРоднуюСтруктуруДереваИзВнешнего(ВремРодноеДерево.Строки, ДеревоРезультат.Строки); // и рекурсивно заполняется из дерева, где, возможн, типиация создаст проблемы
		
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ВремРодноеДерево, "ДеревоРабот");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоРаботРекурсивно(ДанныеДляДерева, Строка)
	
	РаботыПоРодителю = ДанныеДляДерева.НайтиСтроки(Новый Структура("Родитель", Строка.Работа));
	Для Каждого РаботаПоРодителю Из РаботыПоРодителю Цикл
		НоваяСтрокаДерева = Строка.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаДерева, РаботаПоРодителю);
		ЗаполнитьДеревоРаботРекурсивно(ДанныеДляДерева, НоваяСтрокаДерева);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуРабот()
	
	Если Объект.СценарийПланирования.НовыйВариант = Истина Тогда
		Возврат;
	КонецЕсли; 	
	
	УСОERP_ЗащищенныеФункцииСервер.УСОERP_УтверждениеКалендарногоПланаГрафика_ЗаполнитьТаблицуРабот(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДеревоРабот()
	
	КоллекцияЭлементовДерева = ДеревоРабот.ПолучитьЭлементы();	
	//Развернуть дерево 
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл    
		ИдентификаторСтроки=Строка.ПолучитьИдентификатор();
		Элементы.ДеревоРабот.Развернуть(ИдентификаторСтроки);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить(); 
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоРабот.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоРабот.СуммарнаяРабота");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(WindowsШрифты.ШрифтДиалоговИМеню,,,Истина));
	
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаботыДС.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("РаботыДС.СуммарнаяРабота");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(WindowsШрифты.ШрифтДиалоговИМеню,,,Истина)); 	
	
КонецПроцедуры

&НаКлиенте
Процедура СценарийПланированияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ТекущийСценарий)
		И ТекущийСценарий <> Объект.СценарийПланирования И 		
		Объект.Работы.Количество()>0 Тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("СценарийПланированияПриИзмененииПродолжение",ЭтотОбъект),"Таблица работ будет перезаполнена. Продолжить?", РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Нет);
		
	Иначе
		
		СценарийПланированияПриИзмененииПродолжение(КодВозвратаДиалога.Да,Новый Структура);
		
	КонецЕсли;  	 
	
КонецПроцедуры

&НаКлиенте
Процедура СценарийПланированияПриИзмененииПродолжение(Ответ,ДопПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Объект.СценарийПланирования = ТекущийСценарий;
		Возврат;
	КонецЕсли;
	
	НовыйВариант = ЭтоНовыйВариантСценария(Объект.СценарийПланирования);
	
	Если ТекущийСценарий <> Объект.СценарийПланирования Тогда
		
		ЗаполнитьТаблицуРабот();
		СформироватьДеревоРабот();
		РазвернутьДеревоРабот();
		
		ТекущийОбъектСтроительства = Объект.ОбъектСтроительства;
		ТекущийСценарий = Объект.СценарийПланирования;
		
	КонецЕсли;
	
	УправлениеЭлементамиФормы(ЭтаФорма);
	
КонецПроцедуры  

&НаКлиенте
Процедура ДеревоРаботРаботаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекРабота = Элементы.ДеревоРабот.ТекущиеДанные.Работа;
	
	Если ЗначениеЗаполнено(Объект.КопияСценария) Тогда
		ОткрытьФорму("Справочник.УСОERP_СтроительныеРаботы.Форма.ФормаЭлементаДинамическая",Новый Структура("Ключ",ТекРабота));
	Иначе
		ОткрытьФорму("Справочник.УСОERP_СтроительныеРаботы.Форма.ФормаЭлемента",Новый Структура("Ключ",ТекРабота));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРаботВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекРабота = Элементы.ДеревоРабот.ТекущиеДанные.Работа;
	
	Если ЗначениеЗаполнено(Объект.КопияСценария) Тогда
		ОткрытьФорму("Справочник.УСОERP_СтроительныеРаботы.Форма.ФормаЭлементаДинамическая",Новый Структура("Ключ",ТекРабота));
	Иначе
		ОткрытьФорму("Справочник.УСОERP_СтроительныеРаботы.Форма.ФормаЭлемента",Новый Структура("Ключ",ТекРабота));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРаботПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРаботПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКопиюСценария(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьКопиюСценарияПродолжения",ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения,"Будет создана копия сценария, может занять продолжительное время,продолжить?",РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКопиюСценарияПродолжения(Ответ,ДопПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ТекстОшибки = "";
	
	Если НЕ ПроверитьСценарийНаЗаполненность(ТекстОшибки) Тогда
		ПоказатьПредупреждение(,ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	СоздатьКопиюСценарияНаСервере(); 	
	Элементы.РаботыДС.Обновить();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьСценарийНаЗаполненность(ТекстОшибки)
	
	ТекстОшибки = "";
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("СценарийПланирования",Объект.СценарийПланирования);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УСОERP_СтроительныеРаботы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.УСОERP_СтроительныеРаботы КАК УСОERP_СтроительныеРаботы
	|ГДЕ
	|	НЕ УСОERP_СтроительныеРаботы.СуммарнаяРабота
	|	И НЕ УСОERP_СтроительныеРаботы.ПометкаУдаления
	|	И (УСОERP_СтроительныеРаботы.ОбъемРаботы = 0
	|			ИЛИ УСОERP_СтроительныеРаботы.ЕдиницаОбъема = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка))
	|	И УСОERP_СтроительныеРаботы.Владелец = &СценарийПланирования";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ТекстОшибки = ТекстОшибки+""+УСОERP_УправлениеСтроительнымПроизводством.ПолучитьКодСДР(Выборка.Ссылка)+"."+Выборка.Ссылка+""+Символы.ПС;
		
	КонецЦикла; 		
	
	Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
		ТекстОшибки = "Есть работы с незаполненным объемом: "+Символы.ПС+СокрЛП(ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
		ТекстОшибки = "НЕ ЗАПОЛНЕНЫ ЗНАЧЕНИЯ "+Символы.ПС+ТекстОшибки;
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина; 		
	
КонецФункции  

&НаСервере
Процедура СоздатьКопиюСценарияНаСервере()
	
	УСОERP_ЗащищенныеФункцииСервер.УСОERP_УтверждениеКалендарногоПланаГрафика_ЗаполнитьТаблицуРабот(ЭтотОбъект);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(РаботыДС,"КопияСценария",Объект.КопияСценария,Истина);
	РаботыДС.Отбор.Элементы.Очистить();
	ЭлементОтбора = РаботыДС.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Объект.КопияСценария; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УправлениеЭлементамиФормы(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 

	МодификацияКонфигурацииПереопределяемый.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
		// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// Обработчик подсистемы "Свойства"
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);

	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьРаспределениеРабот(Команда)
	
	УСОERP_ЗащищенныеФункцииСервер.ЗаполнитьРаспределениеРабот(Объект.КопияСценария);
	УправлениеЭлементамиФормы(ЭтотОбъект);  	

КонецПроцедуры

&НаСервереБезКонтекста
Функция ВидимостьКнопкиЗаполнитьРаспределение(КопияСценария)
	
	Если НЕ ЗначениеЗаполнено(КопияСценария) Тогда
		Возврат Ложь;
	КонецЕсли;
		
	Результат = Ложь;
	
	Выборка = Справочники.УСОERP_СтроительныеРаботы.Выбрать(,КопияСценария);
	
	Пока Выборка.Следующий() Цикл
		
		Если ПустаяСтрока(Выборка.ПорядокСортировки) Тогда
			
			Результат = Истина;
			Прервать;
			
		КонецЕсли;
		
		Если НЕ Выборка.ПометкаУдаления И НЕ Выборка.СуммарнаяРабота Тогда
			
			Результат = НЕ Выборка.Распределение.Количество();
			
			ПрерватЬ;
			
		КонецЕсли;
		
	КонецЦикла; 	
	
	Возврат Результат;	
	
КонецФункции


// СтандартныеПодсистемы.Свойства 
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры   

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры 

&НаКлиенте
Процедура РаботыДСВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьЗначение(,Элементы.РаботыДС.ТекущаяСтрока);
КонецПроцедуры


// Конец СтандартныеПодсистемы.Свойства 


#КонецОбласти
